Add Dockerfile, docker compose, ..
